app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."ratings" = 'PG' AND "movies"."id" IN (NULL, NULL)
---
  def index
     @all_ratings = Movie.all_ratings
     @movies = Movie.order(params[:sort_by])


    if params[:ratings]
      @movies = Movie.where(:rating => params[:ratings].keys).order(params[:sort_by])